<?php
/**
 * Created by PhpStorm.
 * User: Li
 * Date: 15/11/5
 * Time: 下午4:25
 */
namespace App\Libraries;

class ReturnCode
{
    //中文错误详情
    public static $codeTexts = [
        0    => '操作成功',
        3100 => '请登录',
        2000 => '签名不正确',
        2001 => '此号码有不当言行已被平台拉入黑名单',
        2002 => '手机号码格式不正确',
        2003 => '新闻不存在',
        2004 => '获取验证码失败',
        2005 => '验证码错误或已失效',
        2006 => 'Token不存在',
        2007 => '请输入手机号码',
        2008 => '微信union_id不存在',
        2009 => '登录失败,你已经被禁用',
        2010 => '还不是会员',
        2011 => '用户uid不存在',
        2012 => '他还不是您的心灵管家,请购买后在拨打',
        2013 => '当前老师已被禁用',
        2014 => '修改失败',
        2015 => '参数错误',
        2016 => '视频不能为空',
        2017 => '老师数据不存在',
        2018 => '保存失败',
        2019 => '提现金额需为100的整数倍',
        2020 => '用户提现账号不存在',
        2021 => '用户账户不存在',
        2022 => '用户钱包可提现金额不足',
        2023 => '提现账号有误',
        2024 => '提现失败',
        2025 => '回答失败',
        2026 => '订单不存在',
        2027 => '投诉的订单不存在',
        2028 => '请选择投诉原因',
        2029 => '请填写遇到的问题',
        2030 => '评论的订单不存在',
        2031 => '请填写评论内容',
        2032 => '老师还未接单',
        2033 => '老师正在通话中',
        2034 => '拨打电话时无手机号码填写时文案提示：填写当前手机号码才能给老师拨打电话（为保护双方隐私拨打电话时对方不会看到您的真实手机号码）',
        2035 => '老师服务被下架或者未绑定手机号码',
        2036 => '您还未付款，支付后就可以立即联系老师电话咨询',
        2037 => '您当前订单的通话时长已用完',
        2038 => '拨打电话异常',
        2039 => '老师uid不存在',
        2040 => '订单创建失败',
        2041 => '请选择推荐的套餐',
        2042 => '推荐套餐不存在',
        2043 => '请选择想要咨询的老师',
        2044 => '咨询失败',
        2045 => '消息内容为空',
        2046 => '您的操作过快,请慢一点',
        2047 => '请不要重复确认订单',
        2048 => '请不要重复投诉订单'
    ];

    public static function create($code)
    {
        return self::$codeTexts[$code];
    }

}
